Strömungssimulation/elbowTurbulent/0/Co
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Co;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
11691
(
0.193013
0.0585566
0.0648314
0.0649254
0.0642434
0.0625925
0.0711403
0.065265
...
)
;

boundaryField
{
    elbowWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    injectorWall
    {
        type            zeroGradient;
    }
    injectorInlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
