Strömungssimulation/elbowTurbulent/0/I
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1;

boundaryField
{
    elbowWall
    {
        type            calculated;
        value           uniform 1;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.141421;
    }
    injectorWall
    {
        type            calculated;
        value           uniform 1;
    }
    injectorInlet
    {
        type            calculated;
        value           uniform 0.258199;
    }
    outlet
    {
        type            calculated;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
