Strömungssimulation/elbowTurbulent/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    elbowWall
    {
        type            nutLowReWallFunction;
	value		uniform 0;
    }
    injectorWall
    {
        type            nutLowReWallFunction;
	value		uniform 0;
    }
    inlet
    {
        type            calculated;
	value		uniform 0;
    }
    injectorInlet
    {
        type            calculated;
	value		uniform 0;
    }
    outlet
    {
        type            calculated;
	value		uniform 0;
    }
}

// ************************************************************************* //
