Strömungssimulation/elbowTurbulent/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.36;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    elbowWall
    {
        type            omegaWallFunction;
	value		$internalField;
    }
    injectorWall
    {
        type            omegaWallFunction;
	value		$internalField;
    }
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
	mixingLength	8;
	value		$internalField;
    }
    injectorInlet
    {
        type            turbulentMixingLengthFrequencyInlet;
	mixingLength	2;
	value		$internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
