Strömungssimulation/elbowTurbulent/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother	DICGaussSeidel;
        tolerance       1e-05;
        relTol          0.005;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
    "(U|k|omega)Final"
    {
	$U;
	relTol		0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    nOuterCorrectors 25;
/*    relaxationFactors
    {
	    fields
	    {
		    p	0.3;
		    pFinal	0;
	    }
	    equations
	    {
		    "(U|k|omega)"	0.7;
		    "(U|k|omega)Final"	1;
	    }
    }*/
    outerCorrectorResidualControl
    {
/*	    p
	    {
		    relTol	0;
		    tolerance	2e-2;
	    }*/
	    "(U|k|omega)"
	    {
		    relTol	0;
		    tolerance	1e-3;
	    }
    }
//    pRefCell  0;
//    pRefValue 0;
}

// ************************************************************************* //
